cf/DataProcessors/BookkeepingPosting.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>BookkeepingPosting</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DynamicFilter</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DisplayedDocumentsStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.DocumentBookkeepingStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentTypes</Name>
					<Type>
						<v8:Type>v8:TypeDescription</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OnlyChoosenTypes</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PartialJournal</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SelectTopX</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortingMethod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TopSelectionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ManualBookkeepingOperation</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChooseFromList</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>DocumentList</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Check</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Status</Name>
							<Type>
								<v8:Type>cfg:EnumRef.DocumentBookkeepingStatus</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationTemplate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.BookkeepingOperationsTemplates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperation</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.BookkeepingOperation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Remarks</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentAuthor</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentComment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationPosted</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationDeletionMark</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationAuthor</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationComment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BookkeepingOperationManual</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ActionState</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ActionStates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ChoosenDocumentsFromList</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Document</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/Enums/DocumentBookkeepingStatus.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>DocumentBookkeepingStatus</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NotBookkeepingPosted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BookkeepingPosted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BookkeepingPostingIsNotAllowed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/BookkeepingPosting/Forms/SettingsForm/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////
/// FORM EVENTS

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	DocumentsFormAtServer.SetVisibleCompanyItem(ThisForm);
	ThisObject.Company	= CommonAtServerCached.DefaultCompany();
	
	ParametersStructure = GetFromTempStorage(Parameters.TempStorageAddress);
	For Each KeyAndValue In ParametersStructure Do
		ThisForm[KeyAndValue.Key] = KeyAndValue.Value;
	EndDo;	
	
	DocumentListBox = BookkeepingCommon.GetAvailableListOfDocumentsToBookkeepingPosting();
	DocumentListBox.SortByPresentation();
	
	If DocumentTypes.Types().Count() > 0 Then
		For Each Type In DocumentTypes.Types() Do
			EmptyRef = New(Type);	
			FoundRow = DocumentListBox.FindByValue(EmptyRef);
			If FoundRow <> Undefined Then
				FoundRow.Check = True;
			EndIf;
		EndDo;
	Else
		For Each ValueListItem In DocumentListBox Do
			ValueListItem.Check = True;
		EndDo;
	EndIf;
	
	Items.ChooseFromList.TypeRestriction = DocumentTypes;
	Items.ChoosenDocumentsFromListValue.TypeRestriction = Items.ChooseFromList.TypeRestriction;
	
EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer(Cancel, CheckedAttributes)
	
	If DisplayedDocumentsStatus = PredefinedValue("Enum.DocumentBookkeepingStatus.BookkeepingPosted") Then
		CheckedAttributes.Add("DateFrom");
		CheckedAttributes.Add("DateTo");
	EndIf;	
	
	If SelectTopX Then
		CheckedAttributes.Add("TopSelectionNumber");
	EndIf;	
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	UpdateDialog();
EndProcedure

///////////////////////////////////////////////////////////
/// ITEM EVENTS

&AtClient
Procedure ChooseFromListOnChange(Item)
	UpdateDialog();
EndProcedure

&AtClient
Procedure DocumentListBoxCheckOnChange(Item)
	Items.ChooseFromList.TypeRestriction = GetDocumentTypes();
	Items.ChoosenDocumentsFromListValue.TypeRestriction = Items.ChooseFromList.TypeRestriction;
EndProcedure

&AtClient
Procedure ApplySettings(Command)
	
	DocumentTypes = GetDocumentTypes();
	
	For Each KeyAndValue In ParametersStructure Do
		ParametersStructure[KeyAndValue.Key] = ThisForm[KeyAndValue.Key];
	EndDo;	
	
	PutToTempStorage(ParametersStructure,Parameters.TempStorageAddress);
	
	NotifyChoice(True);
	
EndProcedure

&AtClient
Procedure DisplayedDocumentsStatusOnChange(Item)
	
	If DisplayedDocumentsStatus = PredefinedValue("Enum.DocumentBookkeepingStatus.BookkeepingPostingIsNotAllowed") Then
		
		ManualBookkeepingOperation = 0;
		
	EndIf;	
	
	UpdateDialog();
	
EndProcedure

&AtClient
Procedure SelectTopXOnChange(Item)
	UpdateDialog();
EndProcedure

&AtClient
Procedure PeriodSetting(Command)
	
	Dialogue = New StandardPeriodEditDialog;
	Dialogue.Period = New StandardPeriod(DateFrom, DateTo);
	
	Dialogue.Show(New NotifyDescription("PeriodSettingEnd", ThisForm));
	
EndProcedure
	
&AtClient
Procedure PeriodSettingEnd(Value, PeriodParameters) Export 
	
	If Not Value = Undefined Then
		
		DateFrom= Value.StartDate;
		DateTo	= Value.EndDate;
		
	EndIf;
	
EndProcedure

&AtClient
Procedure LoadFromSpreadsheet(Command)
	
	// to do
	//ColumnsStructure = New Structure("Document",Nstr("en='Document';pl='Dokument';ru='Документ'"));	
	//ColumnsTypesStructure = New Structure("Document",GetDocumentTypes());	
	//DocumentsTabularPartsProcessing.OpenLoadingFromSpreadsheet(Undefined,"ChoosenDocumentsFromList",ColumnsStructure,,ThisForm,ColumnsTypesStructure);
	
EndProcedure

&AtClient
Procedure ChoiceProcessing(SelectedValue, ChoiceSource)
	
	If SelectedValue.TypeOfChoice = "TABULARPARTLOADING" Then
		ChoosenDocumentsFromList.LoadValues(SelectedValue.TabularPartValueTable.UnloadColumn("Document"));
	EndIf;

EndProcedure

///////////////////////////////////////////////////////////
///Other

&AtClient
Function GetDocumentTypes()
	
	DocumentArray = New Array;
	For Each DocumentListBoxItem In DocumentListBox Do 
		If DocumentListBoxItem.Check Then
			DocumentArray.Add(TypeOf(DocumentListBoxItem.Value));
		EndIf;	
	EndDo;	
		
	Return New TypeDescription(DocumentArray);
	
EndFunction	

&AtClient
Procedure UpdateDialog()
	
	If ChooseFromList = 0 Then
		Items.GroupTabs.CurrentPage = Items.GroupFilter;
	Else
		Items.GroupTabs.CurrentPage = Items.GroupChooseFromList;
	EndIf;	
	
	Items.DateFrom.AutoMarkIncomplete = (DisplayedDocumentsStatus = PredefinedValue("Enum.DocumentBookkeepingStatus.BookkeepingPosted"));
	Items.DateTo.AutoMarkIncomplete   = (DisplayedDocumentsStatus = PredefinedValue("Enum.DocumentBookkeepingStatus.BookkeepingPosted"));
	
	Items.DateFrom.MarkIncomplete = Items.DateFrom.AutoMarkIncomplete AND NOT ValueIsFilled(DateFrom);
	Items.DateTo.MarkIncomplete   = Items.DateTo.AutoMarkIncomplete   AND NOT ValueIsFilled(DateTo);
	
	Items.PartialJournal.Enabled = (DisplayedDocumentsStatus = PredefinedValue("Enum.DocumentBookkeepingStatus.BookkeepingPosted"));
	
	Items.TopSelectionNumber.Enabled = SelectTopX;
	
	Items.ManualBookkeepingOperation.Enabled = (DisplayedDocumentsStatus <> PredefinedValue("Enum.DocumentBookkeepingStatus.BookkeepingPostingIsNotAllowed"));
	
EndProcedure
